app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
  <div class="span8">
    <% if @user.microposts.any? %>